models/MultiParagraphs.dot
digraph G {
  graph [splines="ortho" pad=0.5 ranksep="1.2.equally" nodesep="1.2.equally"]
  edge [color="gray50"]
  node [shape="box" fontname="Helvetica-bold"]

  ParagraphsBlock [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ParagraphsBlock</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  QuoteBlock [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>QuoteBlock</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+source : ReferenceToCitationElement&#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+author : «Bibliography»Contributor&#91;0..1&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  ReviewBlock [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ReviewBlock</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+reviewer : String&#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+date : DateTime&#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+appliesFrom : IdElement</TD></TR>
            <TR><TD ALIGN="LEFT">+appliesTo : IdElement&#91;0..1&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  AdmonitionBlock [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>AdmonitionBlock</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+type : AdmonitionType</TD></TR>
            <TR><TD ALIGN="LEFT">+name : TextElement&#91;0..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+class : String&#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+uri : Uri&#91;0..1&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  AdmonitionType [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER">«enumeration»</TD></TR>\n<TR><TD ALIGN="CENTER"><B>AdmonitionType</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">warning</TD></TR>
            <TR><TD ALIGN="LEFT">note</TD></TR>
            <TR><TD ALIGN="LEFT">tip</TD></TR>
            <TR><TD ALIGN="LEFT">important</TD></TR>
            <TR><TD ALIGN="LEFT">caution</TD></TR>
            <TR><TD ALIGN="LEFT">statement</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]

  ParagraphsBlock -> QuoteBlock [dir="back" arrowtail="onormal" arrowhead="onormal"]
  ParagraphsBlock -> ReviewBlock [dir="back" arrowtail="onormal" arrowhead="onormal"]
  ParagraphsBlock -> AdmonitionBlock [dir="back" arrowtail="onormal" arrowhead="onormal"]
  AdmonitionType -> AdmonitionBlock [dir="direct" arrowtail="onormal" arrowhead="vee"]
}
